desafios/14/artillery-log.txt
Phase started: unnamed (index: 0, duration: 1s) 12:55:57(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 12:55:58(-0300)

--------------------------------------
Metrics for period to: 12:56:00(-0300) (width: 1.573s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 643/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 58
  median: ...................................................................... 37
  p95: ......................................................................... 51.9
  p99: ......................................................................... 54.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 389.7
  max: ......................................................................... 877.5
  median: ...................................................................... 772.9
  p95: ......................................................................... 871.5
  p99: ......................................................................... 871.5


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 12:56:01(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 643/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 58
  median: ...................................................................... 37
  p95: ......................................................................... 51.9
  p99: ......................................................................... 54.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 389.7
  max: ......................................................................... 877.5
  median: ...................................................................... 772.9
  p95: ......................................................................... 871.5
  p99: ......................................................................... 871.5